Documents/УправлениеПеней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеПеней</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействиеПени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УправлениеПеней/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)

	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.Дата));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		Объект.ЛицевыеСчета.Очистить();
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	


КонецПроцедуры

&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Объект.ЛицевыеСчета.Загрузить(ТаблицаДляЗагрузки);
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()
